---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MassFailures.AutoGlazingFailedError
source: html/67a7ff7f-ebea-b3ad-6af2-2cad9ee03073.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MassFailures.AutoGlazingFailedError Property

Failure in Auto-Glazing region computation.

## Syntax (C#)
```csharp
public static FailureDefinitionId AutoGlazingFailedError { get; }
```